# AnalysisDisplayDiagramSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings Constructor
AnalysisDisplayDiagramSettings Class See Also
---
Constructs a default instance of diagram settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayDiagramSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayDiagramSettings()
```

# See Also
AnalysisDisplayDiagramSettings Class
AnalysisDisplayDiagramSettings Overload
Autodesk.Revit.DB.Analysis Namespace